InformationRegisters/УсловияОферт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияОферт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеУсловий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОферты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфертПоОблигациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбъявления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоДляФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведенииДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриОтменеПроведенияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиСправочников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийВызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗагрузкеДанныхВАнкету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписьюРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДвиженийРегистровНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УсловияОферт/Ext/ManagerModule.bsl
Функция GUIDToUUID(GUID) Экспорт

    Возврат Сред(GUID, 20, 4) + Прав(GUID, 12) + Сред(GUID, 15, 4) + Сред(GUID, 10, 4) + Лев(GUID, 8);

КонецФункции

Процедура ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений(Облигация, Организация) Экспорт

	ДатаОповещения = НачалоДня(ТекущаяДата());
	
	ТаблицаПартий = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПартииПоАСиРегистрациейЭСП(ДатаОповещения, Облигация, Организация);
	Если ТаблицаПартий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПодключения = РаботаСоСтрокамиКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	СсылкаИБ = СтрШаблон("e1c://server/%1/%2", ПараметрыПодключения.Srvr, ПараметрыПодключения.Ref);
	
	Оповещение = Новый Структура("Организация, Облигация, Дата, ТекстОповещения", Организация, Облигация, Формат(ДатаОповещения, "ДЛФ=DD"), "");
	Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "<table border=""0"" cellspacing=""1"" bgcolor=""#000000""><tr bgcolor=""#FFFFFF""><td><b>Клиент</b></td></tr>";
	
	МассивКлиентов = ТаблицаПартий.ВыгрузитьКолонку("Клиент");
	РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивКлиентов);
	Для каждого Клиент Из МассивКлиентов Цикл

		Ссылка = СсылкаИБ;
		
		Ссылка = Ссылка + "#e1cib/command/Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Команда.ОбработкаСсылкиОбъявленияОферты?cmdprm=";
		Ссылка = Ссылка + "СправочникСсылка.Облигации:" + GUIDToUUID(Строка(Облигация.УникальныйИдентификатор()));
		Ссылка = Ссылка + ",СправочникСсылка.ЮрФизЛица:" + GUIDToUUID(Строка(Клиент.УникальныйИдентификатор()));
		Ссылка = Ссылка + ",СправочникСсылка.Организации:" + GUIDToUUID(Строка(Организация.УникальныйИдентификатор()));
		
		Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "<tr bgcolor=""#FFFFFF""><td valign = ""top""><A href=""" + Ссылка + """>" + Строка(Клиент) + "</A></td></tr>";
	
	КонецЦикла;

	Оповещение.ТекстОповещения = Оповещение.ТекстОповещения + "</table>";
	
	Справочники.Оповещения.СформироватьОповещения("РегистрСведений.УсловияОферт.ПроинформироватьОНеобходимостиЗаведенияДокументаРегистрацииСведений", Перечисления.ТипыСобытий.ВнешнийВызов, Оповещение);
	
КонецПроцедуры
